In [3]:
try:
    file = open('data.csv','x')
    file.close()
except:
    print("The file is already there.")

The file is already there.

In [7]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   sn   name  age    address
0   1    Sam   23  Kathmandu
1   2    Ram   22    Pokhara
2   3   Pari   33   Lalitpur
3   4   Hari   12    Damauli
4   5   Roji   23  Kathmandu
5   6  Mamta   23    Pokhara

In [14]:
df.head(3)

   sn  name  age    address
0   1   Sam   23  Kathmandu
1   2   Ram   22    Pokhara
2   3  Pari   33   Lalitpur

In [13]:
df.tail(2)

   sn   name  age    address
4   5   Roji   23  Kathmandu
5   6  Mamta   23    Pokhara

In [17]:
import pandas as pd
df = pd.read_csv('data.csv', nrows = 3)   # this is similar to df.head(3)
df

   sn  name  age    address
0   1   Sam   23  Kathmandu
1   2   Ram   22    Pokhara
2   3  Pari   33   Lalitpur

In [19]:
import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
df

     name  age    address
sn
1     Sam   23  Kathmandu
2     Ram   22    Pokhara
3    Pari   33   Lalitpur
4    Hari   12    Damauli
5    Roji   23  Kathmandu
6   Mamta   23    Pokhara

In [21]:
# we can choose the dictionary means we can select whichever column we want  

import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn', usecols = ['sn','name','age'])   
df

     name  age
sn
1     Sam   23
2     Ram   22
3    Pari   33
4    Hari   12
5    Roji   23
6   Mamta   23

In [23]:
import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
df.iloc[1:4]           #entire sn 1 is actually index(1) so it prints values from sn 2

    name  age   address
sn
2    Ram   22   Pokhara
3   Pari   33  Lalitpur
4   Hari   12   Damauli

In [24]:
import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
df.iloc[1:4,0:2]           #entire sn 1 is actually index(1) so it prints values from sn 2

# iloc is index localizer

    name  age
sn
2    Ram   22
3   Pari   33
4   Hari   12

In [26]:
import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
df.loc[2:5,"sn":"age"]

    name  age
sn
2    Ram   22
3   Pari   33
4   Hari   12
5   Roji   23

In [31]:
import pandas as pd
df = pd.read_csv('data.csv', index_col = 'name')   
df.loc['Ram':'Hari']

      sn  age   address
name
Ram    2   22   Pokhara
Pari   3   33  Lalitpur
Hari   4   12   Damauli

In [33]:
import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
df['name']

sn
1      Sam
2      Ram
3     Pari
4     Hari
5     Roji
6    Mamta
Name: name, dtype: object

In [34]:
import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
list(df['name'])

['Sam', 'Ram', 'Pari', 'Hari', 'Roji', 'Mamta']

In [47]:
import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
df['name'] == 'Ram'

sn
1    False
2     True
3    False
4    False
5    False
6    False
Name: name, dtype: bool

In [46]:
import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
df[df['name'] == 'Ram']

   name  age  address
sn
2   Ram   22  Pokhara

In [45]:
import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
#df[df['name'] == 'Ram'] 
df[df['age'] > 22]

     name  age    address
sn
1     Sam   23  Kathmandu
3    Pari   33   Lalitpur
5    Roji   23  Kathmandu
6   Mamta   23    Pokhara

In [44]:
#using multiple conditions

import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
df[(df['address'] == 'Pokhara') & (df['age'] > 22)]

     name  age  address
sn
6   Mamta   23  Pokhara

In [51]:
#using multiple conditions and creating new scv file

import pandas as pd
df = pd.read_csv('data.csv', index_col = 'sn')   
df = df[(df['address'] == 'Pokhara') | (df['age'] > 15)] 
df.to_csv('new_data.csv')
df

     name  age    address
sn
1     Sam   23  Kathmandu
2     Ram   22    Pokhara
3    Pari   33   Lalitpur
5    Roji   23  Kathmandu
6   Mamta   23    Pokhara

In [53]:
import pandas as pd
data = {'Names':['Ram','Sam','Hari','Pari','Roji'],
        'address':['Kathmandu','Pokhara','Lalitpur','Chitwan','Pokhara'],
        'age':[15,23,20,34,28]}

df=pd.DataFrame(data)
df.to_csv('books.csv')
df.head()
df

  Names    address  age
0   Ram  Kathmandu   15
1   Sam    Pokhara   23
2  Hari   Lalitpur   20
3  Pari    Chitwan   34
4  Roji    Pokhara   28

In [12]:
import pandas as pd
data = {'name' == ['Ram','Sam','Hari','Pari','Roji'],
       'age' == [45,67],
       'address' == ['Pkr','Ktm']}

df=pd.DataFrame(data)
df.to_json('new_data.json')
df

       0
0  False

In [3]:
import csv
data = [['sn','name','age','address'],
        [1,'Ram',32,'Ktm'],
        [2,'Sam',22,'Pkr'],
        [3,'Pari',34,'Lalitpur'],
        [4,'Hari',23,'Chitwan'],
        [5,'Preeti',43,'Damauli']]

file = open('list_data.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [4]:
import pandas as pd
df = pd.read_csv('list_data.csv',index_col="sn")
df

      name  age   address
sn
1      Ram   32       Ktm
2      Sam   22       Pkr
3     Pari   34  Lalitpur
4     Hari   23   Chitwan
5   Preeti   43   Damauli

In [6]:
import csv
file = open('list_data.csv')
reader = csv.DictReader(file)

for row in reader:
    print(row)

{'sn': '1', 'name': 'Ram', 'age': '32', 'address': 'Ktm'}
{'sn': '2', 'name': 'Sam', 'age': '22', 'address': 'Pkr'}
{'sn': '3', 'name': 'Pari', 'age': '34', 'address': 'Lalitpur'}
{'sn': '4', 'name': 'Hari', 'age': '23', 'address': 'Chitwan'}
{'sn': '5', 'name': 'Preeti', 'age': '43', 'address': 'Damauli'}

In [9]:
import csv
data = []
file = open('list_data.csv')
reader = csv.DictReader(file)

for row in reader:
    print(row)

{'sn': '1', 'name': 'Ram', 'age': '32', 'address': 'Ktm'}
{'sn': '2', 'name': 'Sam', 'age': '22', 'address': 'Pkr'}
{'sn': '3', 'name': 'Pari', 'age': '34', 'address': 'Lalitpur'}
{'sn': '4', 'name': 'Hari', 'age': '23', 'address': 'Chitwan'}
{'sn': '5', 'name': 'Preeti', 'age': '43', 'address': 'Damauli'}

In [8]:
import csv
data = []
file = open('list_data.csv')
reader = csv.DictReader(file)

for row in reader:
    data.append(row)
data

[{'sn': '1', 'name': 'Ram', 'age': '32', 'address': 'Ktm'},
 {'sn': '2', 'name': 'Sam', 'age': '22', 'address': 'Pkr'},
 {'sn': '3', 'name': 'Pari', 'age': '34', 'address': 'Lalitpur'},
 {'sn': '4', 'name': 'Hari', 'age': '23', 'address': 'Chitwan'},
 {'sn': '5', 'name': 'Preeti', 'age': '43', 'address': 'Damauli'}]

In [13]:
import csv
csv_columns = ['sn','name','age','address']
data = [{'sn': '1', 'name': 'Ram', 'age': '32', 'address': 'Ktm'},
         {'sn': '2', 'name': 'Sam', 'age': '22', 'address': 'Pkr'},
         {'sn': '3', 'name': 'Pari', 'age': '34', 'address': 'Lalitpur'},
         {'sn': '4', 'name': 'Hari', 'age': '23', 'address': 'Chitwan'},
         {'sn': '5', 'name': 'Preeti', 'age': '43', 'address': 'Damauli'}]

file = open("dict_data.csv",'w')
writer = csv.DictWriter(file, fieldnames = csv_columns)
writer.writeheader()
writer.writerows(data)